# Modul 2: MySQL

## `MySQL-python connector`

# Cara 1

In [2]:
# !pip install mysql-connector-python
# !pip install sqlalchemy

In [1]:
# import libraries
import mysql.connector
import pandas as pd

In [2]:
# connector
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'rafdyrizq',
    database = 'world'
)

In [3]:
# buat function 

# buat akses ke database
myCursor = mydb.cursor()

def sql_df(myQuery):
    
    # eksekusi query
    myCursor.execute(myQuery)
    
    # menampilkan result dalam bentuk tuple di dalam list
    myResult = myCursor.fetchall()
    
    # menampilkan result ke dalam dataframe python
    df = pd.DataFrame(myResult, columns=myCursor.column_names)
    
    return df

In [4]:
# tulis query pada argument dari function sql_df
sql_df(''' select * from country limit 5 ''')

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,ABW,Aruba,North America,Caribbean,193.00,NaN,103000,78.4,828.00,793.00,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW
1,AFG,Afghanistan,Asia,Southern and Central Asia,652090.00,1919.0,22720000,45.9,5976.00,None,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1,AF
2,AGO,Angola,Africa,Central Africa,1246700.00,1975.0,12878000,38.3,6648.00,7984.00,Angola,Republic,José Eduardo dos Santos,56,AO
3,AIA,Anguilla,North America,Caribbean,96.00,NaN,8000,76.1,63.20,None,Anguilla,Dependent Territory of the UK,Elisabeth II,62,AI
4,ALB,Albania,Europe,Southern Europe,28748.00,1912.0,3401200,71.6,3205.00,2500.00,Shqipëria,Republic,Rexhep Mejdani,34,AL

# Cara 2

In [5]:
# import libraries
import mysql.connector
import pandas as pd
import sqlalchemy as alc

In [6]:
# Create engine
engine = alc.create_engine('mysql+mysqlconnector://root:rafdyrizq@localhost/sakila')

In [7]:
# tulis query dan simpan dalam variabel
myQuery = ''' select * from actor limit 5; '''

# tampilkan dalam dataframe
pd.read_sql_query(myQuery, engine)

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [8]:
# tulis query dan simpan dalam variabel
myQuery = ''' select * from actor limit 5; '''

# tampilkan dalam dataframe
pd.read_sql_query(myQuery, engine)

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33